# Programming in Python for Data Science 

# Assignment 3: Tidy Data and Joining Dataframes

You can't learn technical subjects without hands-on practice. The assignments are an important part of the course. To submit this assignment you will need to make sure that you save your Jupyter notebook. 

Below are the links of 2 videos that explain:

1. [How to save your Jupyter notebook](https://youtu.be/0aoLgBoAUSA) and,       
2. [How to answer a question in a Jupyter notebook assignment](https://youtu.be/7j0WKhI3W4s).

### Assignment Learning Goals:

By the end of the module, students are expected to:

- Explain what tidy data is.
- Use [`.melt()`](https://pandas.pydata.org/docs/reference/api/pandas.melt.html) and [`.pivot()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pivot.html) to reshape dataframes, specifically to make tidy data.
- Learn how to reset a dataframe's index.
- Combine dataframes using [`.merge()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) and [`.concat()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and know when to use these different methods.
- Understand the different joining methods.

This assignment covers [Module 3](https://prog-learn.mds.ubc.ca/en/module3) of the online course. You should complete this module before attempting this assignment.

Any place you see `...`, you must fill in the function, variable, or data to complete the code. Substitute the `None` and the `raise NotImplementedError # No Answer - remove if you provide an answer` with your completed code and answers then proceed to run the cell!

Note that some of the questions in this assignment will have hidden tests. This means that no feedback will be given as to the correctness of your solution. It will be left up to you to decide if your answer is sufficiently correct. These questions are worth 2 points.

In [1]:
# Import libraries needed for this lab
from hashlib import sha1
import pandas as pd
import test_assignment3 as t
import altair as alt

## 1.  Tidy Data

**Question 1(a)** <br> {points: 1}  

Which of the following do **NOT** characterize a tidy dataset? *note - there may be more than 1 correct answers to this question*

A) Each row is a single variable

B) There are no missing or erroneous values

C) Each value is a single cell

D) Each variable is a single column

_Assign your answer to an object called `answer1_a` in the code chunk below. Make sure your answer contains uppercase letters and surround it with quotation marks and square brackets.  If there are more than one answers to this question, separate each letter with a comma within the square brackets. For example if you believe the answer is A, B and C your answer would like this:      
`answer1_a = ['A', 'B', 'C')`_

In [2]:
answer1_a = ["A", "B"]

In [3]:
t.test_1a(answer1_a)

'Success'

**Question 1(b)** 
<br> {points: 1}  

The data below is wine ratings given for 3 wines by 5 different wine tasters. We are interested in seeing if Taster or Wine type influences the rating.  Given that motivation, which arrangement of the data set show below is "tidy"?

##### Data set 1:

|     Taster       | Chardonnay | Pinot Grigio | Pinot Blanc |
|------------|------------|--------------|-----------------|
| 001 | 75         | 89           | 92              |
| 002 | 89         | 88           | 89              |
| 003 | 72         | 90           | 95              |
| 004 | 85         | 81           | 90              |
| 005 | 83         | 89           | 88              |


##### Data set 2:
|   Wine | Taster 001 | Taster 002 | Taster 003 | Taster 004 | Taster 005 |
|------------|------------|--------------|-----------------|-------|---------|
| Chardonnay | 75         | 89           | 72              | 85 | 83
| Pinot Grigio | 89         | 88           | 90             | 81 | 89 |
| Pinot Blanc | 92         | 89           | 95              | 90 | 88 |

##### Data set 3:

| Taster           | Wine | Rating | 
|------------|------------|----|
| 001 |  Chardonnay |  75         | 
| 002 |  Chardonnay | 89         | 
| 003 |  Chardonnay |72         |  
| 004 |  Chardonnay |85         | 
| 005 | Chardonnay | 83         |  
| 001 |  Pinot Grigio | 89         | 
| 002 |  Pinot Grigio | 88         | 
| 003 |  Pinot Grigio | 90         | 
| 004 |  Pinot Grigio | 81         | 
| 005 |  Pinot Grigio | 90         | 
| 001 |  Pinot Blanc | 92         | 
| 002 | Pinot Blanc | 89         |
| 003 | Pinot Blanc | 95         | 
| 004 | Pinot Blanc | 90         | 
| 005 | Pinot Blanc | 88         | 

##### Data set 4: 
| Taster    | Chardonnay Rating | 
|------------|------------|
| 001 |  75         | 
| 002 |   89         | 
| 003 |  72         |  
| 004 | 85         | 
| 005 | 83         |  

| Taster           | Pinot Grigio Rating | 
|------------|------------|
| 001 |   89         | 
| 002 |  88         | 
| 003 |  90         | 
| 004 | 81         | 
| 005 |  90         | 

| Taster           | Pinot Blanc Rating | 
|------------|------------|
| 001 |   92         | 
| 002 |  89         |
| 003 |  95         | 
| 004 |  90         | 
| 005 |  88         | 

Given that motivation, which arrangement of the data set show below is "tidy"?

_Assign your answer to an object called `answer1_b` in the code chunk below. Make sure your answer is surrounded by square brackets. If there are more than one answers to this question, separate each number with a comma in the square brackets. For example if you believe the answer is 1, 2 and 3 your answer would like this:   
`answer1_b = [1, 2, 3]`_

In [4]:
answer1_b = [3]

In [5]:
t.test_1b(answer1_b)

'Success'

**Question 1(c)** <br> {points: 2}  

To answer the question, assign the letter associated with the correct answer to a variable in the code cell below:   

Why is the primary goal of data wrangling getting dataframes into the tidy data format?
 
A) Having data expressed in such a way, allows for easier readability and is more aesthetically pleasing. 

B) Tidy format uses less storage space on your computer. 

C) Many or most modern Data Science tools accept the tidy data format directly (or very close to that) and we need to get the data in a state ready for analysis.

*Answer in the cell below using the uppercase letter associated with your answer. Place your answer between `""`, assign the correct answer to an object called `answer1_c`.*

In [6]:
answer1_c = "C"

In [7]:
assert 'answer1_c' in locals(), "Your answer should be named 'answer1_c'"

# Note that this test has been hidden intentionally.
# It will provide no feedback as to the correctness of your answers.
# Thus, it is up to you to decide if your answer is sufficiently correct.

**Question 1(d)** <br> {points: 1}  

Use `.pivot()` or `.melt()` to tidy the `planes1` dataframe below to convert it to tidy data. Name the new dataframe `planes2`

In [8]:
flights = {'on_time': ['yes', 'no'],
           'airline_US': [18, 17],
           'airline_UA' : [13, 9]
          }
planes1 = pd.DataFrame(flights, columns = ['on_time', 'airline_US', 'airline_UA'])
planes1

  on_time  airline_US  airline_UA
0     yes          18          13
1      no          17           9

In [9]:
planes2 = (planes1.melt(
                    id_vars=['on_time'],
                    value_vars=['airline_US', 'airline_UA'],
                    var_name='on_time_flights',
                    value_name='value'))
planes2

  on_time on_time_flights  value
0     yes      airline_US     18
1      no      airline_US     17
2     yes      airline_UA     13
3      no      airline_UA      9

In [10]:
t.test_1d(planes2)

'Success'

**Question 1(e)** <br> {points: 1}  

We are interested in determining if the number of medals is influenced by the country and the type of medal. Given this statistical question, is the below dataset tidy data? 

\begin{array}{ccccc}
& & COUNTRY & GOLD & SILVER & BRONZE\\
& 1 & USA & 46 & 37 & 38\\
medals\_df = & 2 & CHN & 38 & 23 & 17\\
& 3 & GBR & 29 & 18 & 26\\
\end{array}

To answer the question, assign the letter associated with the correct answer to a variable in the code cell below:   
 
A) The dataframe is tidy.

B) The dataframe is ***NOT*** tidy and cannot be changed to tidy data by using `.pivot()` or `.melt()`. 

C) The dataframe is ***NOT*** tidy and can be changed to tidy data by using `.pivot()`.

D) The dataframe is ***NOT*** tidy and can be changed to tidy data by using `.melt()`.

*Answer in the cell below using the uppercase letter associated with your answer. Place your answer between `""`, assign the correct answer to an object called `answer1_e`.*

In [11]:
answer1_e = "D"

In [12]:
t.test_1e(answer1_e)

'Success'

## 2.  Pivot and Melt

**Question 2(a)** <br> {points: 1}  

The file at this [url](https://raw.githubusercontent.com/plotly/datasets/master/school_earnings.csv) contains data about the average wage in 1000 dollars per year for men and women graduates from various US universities. 

***Note: many popular datasets have sex as a feature where the possible values are male and female. This representation reflects how the data were collected and is not meant to imply that, for example, gender is binary.***


Load only the `School`, `Women` and `Men` columns into a dataframe named `wages`.

In [13]:
wages = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/school_earnings.csv', usecols=[0, 1, 2])
wages

        School  Women  Men
0          MIT     94  152
1     Stanford     96  151
2      Harvard    112  165
3       U.Penn     92  141
4    Princeton     90  137
5      Chicago     78  118
6   Georgetown     94  131
7        Tufts     76  112
8         Yale     79  114
9     Columbia     86  119
10        Duke     93  124
11   Dartmouth     84  114
12         NYU     67   94
13  Notre Dame     73  100
14     Cornell     80  107
15    Michigan     62   84
16       Brown     72   92
17    Berkeley     71   88
18       Emory     68   82
19        UCLA     64   78
20       SoCal     72   81

In [14]:
t.test_2a(wages)

'Success'

**Question 2(b)** <br> {points: 1}  

We are interested in seeing if a person's wage is influenced by the variables gender and school. Given this statistical question, which tidy data criterion is not being satisfied in the dataframe?

To answer the question, assign the letter associated with the correct answer to a variable in the code cell below:   
 
A) Criterion 1: Each row is a single observation      

B) Criterion 2: Each variable is a single column     

C) Criterion 3: Each value is a single cell      

*Answer in the cell below using the uppercase letter associated with your answer. Place your answer between `""`, assign the correct answer to an object called `answer2_b`.*

In [15]:
answer2_b = "B"

In [16]:
t.test_2b(answer2_b)

'Success'

**Question 2(c)** <br> {points: 1}  

Make the dataset tidy by using `.melt()`.    
Use `School` as `id_vars`, `Gender` as `var_name` and `Wage` as `value_name` and sort the dataframe by `School` and then `Gender`.      
Name the new object `tidy_wages`.

In [17]:
tidy_wages = (wages.melt(id_vars=['School'],
                        var_name='Gender',
                        value_name='Wage')
                    .sort_values(['School','Gender']))
tidy_wages

        School Gender  Wage
38    Berkeley    Men    88
17    Berkeley  Women    71
37       Brown    Men    92
16       Brown  Women    72
26     Chicago    Men   118
5      Chicago  Women    78
30    Columbia    Men   119
9     Columbia  Women    86
35     Cornell    Men   107
14     Cornell  Women    80
32   Dartmouth    Men   114
11   Dartmouth  Women    84
31        Duke    Men   124
10        Duke  Women    93
39       Emory    Men    82
18       Emory  Women    68
27  Georgetown    Men   131
6   Georgetown  Women    94
23     Harvard    Men   165
2      Harvard  Women   112
21         MIT    Men   152
0          MIT  Women    94
36    Michigan    Men    84
15    Michigan  Women    62
33         NYU    Men    94
12         NYU  Women    67
34  Notre Dame    Men   100
13  Notre Dame  Women    73
25   Princeton    Men   137
4    Princeton  Women    90
41       SoCal    Men    81
20       SoCal  Women    72
22    Stanford    Men   151
1     Stanford  Women    96
28       Tufts    Men   112
7        Tufts  Women    76
24      U.Penn    Men   141
3       U.Penn  Women    92
40        UCLA    Men    78
19        UCLA  Women    64
29        Yale    Men   114
8         Yale  Women    79

In [18]:
t.test_2c(tidy_wages)

'Success'

**Question 2(d)** <br> {points: 2}  

`.groupby()` the `Gender` column and find the mean `Wage` of each group.    
Save the new dataframe as `wage_means`.

In [19]:
wage_means = tidy_wages.groupby('Gender').mean()
wage_means

              Wage
Gender
Men     113.523810
Women    81.095238

In [20]:
assert 'wage_means' in locals(), "Your answer should be named 'wage_means'"

# Note that this test has been hidden intentionally.
# It will provide no feedback as to the correctness of your answers.
# Thus, it is up to you to decide if your answer is sufficiently correct.

**Question 2(e)** <br> {points: 1}  

Which of the following is True? 

To answer the question, assign the letter associated with the correct answer to a variable in the code cell below:   
 
A) Men and Women's mean wage are approximately equal. 

B) Women are making 0.9 the amount of Men  

C) Men are making 1.2 the amount of Women 

D) Women are making 0.7 the amount of Men 

*Answer in the cell below using the uppercase letter associated with your answer. Place your answer between `""`, assign the correct answer to an object called `answer2_e`.*

In [21]:
answer2_e = "D"

In [22]:
t.test_2e(answer2_e)

'Success'

**Question 2(f)** <br> {points: 1}  

Reverse the operation you performed in **Question 2(c)** using `.pivot()`. Do not forget to reset your index.
You will need to chain `.rename_axis('', axis='columns')` after you reset your axis to adjust for an incorrect axis label. 
Name the untidied object `untidied_wages`.

In [23]:
untidied_wages = (tidy_wages.pivot(index='School', columns='Gender', values='Wage')
                     .reset_index()
                     .rename_axis('', axis='columns')
                 )
 

untidied_wages

        School  Men  Women
0     Berkeley   88     71
1        Brown   92     72
2      Chicago  118     78
3     Columbia  119     86
4      Cornell  107     80
5    Dartmouth  114     84
6         Duke  124     93
7        Emory   82     68
8   Georgetown  131     94
9      Harvard  165    112
10         MIT  152     94
11    Michigan   84     62
12         NYU   94     67
13  Notre Dame  100     73
14   Princeton  137     90
15       SoCal   81     72
16    Stanford  151     96
17       Tufts  112     76
18      U.Penn  141     92
19        UCLA   78     64
20        Yale  114     79

In [24]:
t.test_2f(untidied_wages)

'Success'

**Question 2(g)** <br> {points: 1}  

Using `untidied_wages`  We are trying to answer the question, *Which school has the largest wage gap between among women and men?*

You will need to add a new column in the dataframe named `Wage_Gap` (Men wage - Woman wage). Sort your new dataframe in descending order and name it `wage_gap_df`.

In [25]:
wage_gap_df = (untidied_wages
               .assign(Wage_Gap=untidied_wages['Men'] - untidied_wages['Women'])
               .sort_values('Wage_Gap', ascending=False))

In [26]:
wage_gap_df

        School  Men  Women  Wage_Gap
10         MIT  152     94        58
16    Stanford  151     96        55
9      Harvard  165    112        53
18      U.Penn  141     92        49
14   Princeton  137     90        47
2      Chicago  118     78        40
8   Georgetown  131     94        37
17       Tufts  112     76        36
20        Yale  114     79        35
3     Columbia  119     86        33
6         Duke  124     93        31
5    Dartmouth  114     84        30
12         NYU   94     67        27
13  Notre Dame  100     73        27
4      Cornell  107     80        27
11    Michigan   84     62        22
1        Brown   92     72        20
0     Berkeley   88     71        17
7        Emory   82     68        14
19        UCLA   78     64        14
15       SoCal   81     72         9

In [27]:
t.test_2g(wage_gap_df)

'Success'

**Question 2(h)** <br> {points: 1}  

Plot the dataframe `wage_gap_df` by specifying `School` on the `x-axis` and `Wage_Gap` on the `y-axis`.        
Name this object `wage_gap_plot`. Also sort the `Wage_Gap` values in ascending order. Don't forget to provide an informative title for your plot.

In [28]:
wage_gap_plot = (alt.Chart(wage_gap_df)
                 .mark_bar()
                 .encode(x='School', y='Wage_Gap')
                 .properties(title="Wage Gap in Men and Women graduates across US universities"))
wage_gap_plot

alt.Chart(...)

In [29]:
t.test_2h(wage_gap_plot)

'success'

## 3.  Concat and Merge

**Question 3(a)** <br> {points: 1}  

Combine the following 2 dataframes using either `pd.concat()` or `.merge()`. Drop any duplicate columns if any arise.    
Name the new dataframe `netflix_full`.

In [30]:
netflix1 = pd.read_csv('data/netflix1.csv')
netflix1

,title,type,director,country
0,Planet Earth: The Complete Collection,TV Show,Alastair Fothergill,United Kingdom
1,Bee Movie,Movie,"Steve Hickner, Simon J. Smith","United States, Australia"
2,Calendar Girls,Movie,Madhur Bhandarkar,India
3,Martin Luther: The Idea that Changed the World,Movie,David Batty,United States
4,Chef's Table,TV Show,NaN,United States

In [31]:
netflix2 = pd.read_csv('data/netflix2.csv')
netflix2

,title,date_added,release_year,rating,duration
0,Planet Earth: The Complete Collection,22-Apr-15,2006,TV-PG,1 Season
1,Bee Movie,01-Jan-17,2007,PG,92 min
2,Calendar Girls,15-Oct-17,2015,TV-14,126 min
3,Martin Luther: The Idea that Changed the World,01-Jan-18,2017,TV-PG,55 min
4,Chef's Table,"February 22, 2019",2019,TV-MA,6 Seasons

In [32]:
netflix_full = pd.concat([netflix1, netflix2], axis=1)
netflix_full = netflix_full.loc[:, ~netflix_full.columns.duplicated()]

In [33]:
t.test_3a(netflix_full)

'Success'

**Question 3(b)** <br> {points: 2}  

Add the new dataframe `new_releases` to the existing dataframe `netflix_full` that you made in the previous question.   
Name the new object `netflix_collection`.

In [34]:
new_releases = pd.read_csv('data/netflix3.csv')
new_releases

,title,type,director,country,date_added,release_year,rating,duration
0,Ozark,TV Show,NaN,United States,"August 31, 2018",2018,TV-MA,2 Seasons
1,Friends,TV Show,NaN,United States,NaN,2003,TV-14,10 Seasons
2,Blackfish,Movie,Gabriela Cowperthwaite,United States,12-Dec-16,2013,PG-13,83 min

In [35]:
netflix_collection = pd.concat([netflix_full, new_releases], axis=0) 
netflix_collection

,title,type,director,country,date_added,release_year,rating,duration
0,Planet Earth: The Complete Collection,TV Show,Alastair Fothergill,United Kingdom,22-Apr-15,2006,TV-PG,1 Season
1,Bee Movie,Movie,"Steve Hickner, Simon J. Smith","United States, Australia",01-Jan-17,2007,PG,92 min
2,Calendar Girls,Movie,Madhur Bhandarkar,India,15-Oct-17,2015,TV-14,126 min
3,Martin Luther: The Idea that Changed the World,Movie,David Batty,United States,01-Jan-18,2017,TV-PG,55 min
4,Chef's Table,TV Show,NaN,United States,"February 22, 2019",2019,TV-MA,6 Seasons
0,Ozark,TV Show,NaN,United States,"August 31, 2018",2018,TV-MA,2 Seasons
1,Friends,TV Show,NaN,United States,NaN,2003,TV-14,10 Seasons
2,Blackfish,Movie,Gabriela Cowperthwaite,United States,12-Dec-16,2013,PG-13,83 min

In [36]:
assert 'netflix_collection' in locals(), "Your answer should be named 'netflix_collection'"

# Note that this test has been hidden intentionally.
# It will provide no feedback as to the correctness of your answers.
# Thus, it is up to you to decide if your answer is sufficiently correct.

**Question 3(c)** <br> {points: 1} 

Here are 2 dataframes:


#### Left Dataframe


|      | Name                        | Gender   | Status     | Birth Date   | Birth Place     |
|---: |:----------------------------|:---------|:-----------|:-------------|:-----------------|
|**0**| Gregory E. Chamitoff        | Male     | Active     | 8/6/1962     | Montreal, Canada |
|**1**| Patricia Hilliard Robertson | Female   | Deceased   | 3/12/1963    | Indiana, PA      |
|**2**| Kathleen Rubins             | Female   | Active     | 10/14/1978   | Farmington, CT   |
|**3**| Michael T. Good             | Male     | Management | 10/13/1962   | Parma, OH        |
|**4**| Neil A. Armstrong           | Male     | Deceased   | 8/5/1930     | Wapakoneta, OH   |


#### Right  Dataframe


|     | Name       | Undergraduate Major  | Graduate Major   |   Space Flights |  Space Walks |   Space Walks (hr) |
|----:|:--------------------|:-------------------|:------------------|----------------:|--------:|-----------------:|
|**0**| Buzz Aldrin                 | Mechanical Engineering   | Astronautics          |     2 |     2 |    8 |
|**1**| Patricia Hilliard Robertson | Biology           | Medicine                     |     0 |     0 |    0 |
|**2**| Neil A. Armstrong           | Aeronautical Engineering | Aerospace Engineering |     2 |     1 |    2 |
|**3**| Mae C. Jemison              | Chemical Engineering     | Medicine              |     1 |     0 |    0 |
|**4**| Michael T. Good             | Aerospace Engineering    | Aerospace Engineering |     2 |     4 |   30 |
|**5**| Shannon W. Lucid            | Chemistry                | Biochemistry          |     5 |     0 |    0 |


The above dataframe have been joined together to produce each of the dataframes below, each one using a different joining methods. Match up each of the merged dataframe labelled A-D with it's corresponding join type ('inner', 'outer', 'left', 'right'). 


###### Dataframe A
|  | Name| Gender| Status| Birth Date| Birth Place| Undergraduate Major| Graduate Major|Space Flights |Space Walks |   Space Walks (hr) |
|---:|:----------------------------|:---------|:-----------|:-------------|:---------------|:-------------------------|:----------------------|----------------:|--------------:|-------------------:|
|**0**| Patricia Hilliard Robertson | Female| Deceased| 3/12/1963| Indiana, PA| Biology | Medicine  | 0 |0 |0 |
|**1**| Michael T. Good| Male|Management|10/13/1962|Parma, OH|Aerospace Engineering|Aerospace Engineering|2 |4|30 |
|**2**|Neil A. Armstrong|Male|Deceased| 8/5/1930|Wapakoneta, OH|Aeronautical Engineering|Aerospace Engineering|2|1|2|
|**3**| Buzz Aldrin | NaN | NaN | NaN  | NaN | Mechanical Engineering   | Astronautics |  2 |  2 | 8 |
|**4**| Mae C. Jemison  | NaN  | NaN | NaN  | NaN | Chemical Engineering | Medicine |  1 | 0 |  0 |
|**5**| Shannon W. Lucid   | NaN   | NaN  | NaN | NaN  | Chemistry | Biochemistry   | 5 |    0 |  0 |


###### Dataframe B

|  | Name| Gender| Status| Birth Date| Birth Place| Undergraduate Major| Graduate Major|Space Flights |Space Walks |   Space Walks (hr) |
|---:|:----------------------------|:---------|:-----------|:-------------|:---------------|:-------------------------|:----------------------|----------------:|--------------:|-------------------:|
|**0**| Gregory E. Chamitoff| Male| Active| 8/6/1962| Montreal, Canada | NaN| NaN | NaN |  NaN | NaN |
|**1**| Patricia Hilliard Robertson | Female| Deceased| 3/12/1963| Indiana, PA| Biology | Medicine  | 0 |0 |0 |
|**2**| Kathleen Rubins| Female | Active| 10/14/1978| Farmington, CT| NaN | NaN | NaN | NaN | NaN |
|**3**| Michael T. Good| Male|Management|10/13/1962|Parma, OH|Aerospace Engineering|Aerospace Engineering|2 |4|30 |
|**4**|Neil A. Armstrong|Male|Deceased| 8/5/1930|Wapakoneta, OH|Aeronautical Engineering|Aerospace Engineering|2|1|2|
|**5**| Buzz Aldrin | NaN | NaN | NaN  | NaN | Mechanical Engineering   | Astronautics |  2 |  2 | 8 |
|**6**| Mae C. Jemison  | NaN  | NaN | NaN  | NaN | Chemical Engineering | Medicine |  1 | 0 |  0 |
|**7**| Shannon W. Lucid   | NaN   | NaN  | NaN | NaN  | Chemistry | Biochemistry   | 5 |    0 |  0 |


###### Dataframe C

|  | Name| Gender| Status| Birth Date| Birth Place| Undergraduate Major| Graduate Major|Space Flights |Space Walks |   Space Walks (hr) |
|---:|:----------------------------|:---------|:-----------|:-------------|:---------------|:-------------------------|:----------------------|----------------:|--------------:|-------------------:|
|**0**| Patricia Hilliard Robertson | Female| Deceased| 3/12/1963| Indiana, PA| Biology| Medicine|0 |0 |0 |
|**1**|Michael T. Good| Male|Management|10/13/1962|Parma, OH|Aerospace Engineering|Aerospace Engineering|2 |4|30 |
|**2**|Neil A. Armstrong|Male|Deceased| 8/5/1930|Wapakoneta, OH|Aeronautical Engineering|Aerospace Engineering|2|1|2|

###### Dataframe D



|  | Name| Gender| Status| Birth Date| Birth Place| Undergraduate Major| Graduate Major|Space Flights |Space Walks |   Space Walks (hr) |
|---:|:----------------------------|:---------|:-----------|:-------------|:---------------|:-------------------------|:----------------------|----------------:|--------------:|-------------------:|
|**0**| Gregory E. Chamitoff| Male| Active| 8/6/1962| Montreal, Canada | NaN| NaN | NaN |  NaN | NaN |
|**1**| Patricia Hilliard Robertson | Female| Deceased| 3/12/1963| Indiana, PA| Biology | Medicine  | 0 |0 |0 |
|**2**| Kathleen Rubins| Female | Active| 10/14/1978| Farmington, CT| NaN | NaN | NaN | NaN | NaN |
|**3**| Michael T. Good| Male|Management|10/13/1962|Parma, OH|Aerospace Engineering|Aerospace Engineering|2 |4|30 |
|**4**|Neil A. Armstrong|Male|Deceased| 8/5/1930|Wapakoneta, OH|Aeronautical Engineering|Aerospace Engineering|2|1|2|

In [37]:
answer3c_dfa = "right"
answer3c_dfb = "outer"
answer3c_dfc = "inner"
answer3c_dfd = "left"

In [38]:
t.test_3c(answer3c_dfa, answer3c_dfb, answer3c_dfc, answer3c_dfd)

'Success'

## 4. Green house emissions

The file at this [url](https://raw.githubusercontent.com/plotly/datasets/master/Emissions%20Data.csv) contains data for the amount of greenhouse gas emissions in tonnes **per person** per year _(tons/person)_  for different countries around the world for the years 2008 - 2011.

In [39]:
emissions = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/Emissions%20Data.csv', dtype = {'Year':'object'})

##### Our mission
Our interest instead lies on finding the emission per year per person for each *continent* during the year 2010. It would not make sense to add up these current `Emission` variable as each country has a different population.  Instead,  we will need to find the raw quantity of gas emissions in tonnes per year for each country first, sum these per continent before dividing by the total continent population.

 **Question 4(a)** <br> {points: 1} 
 
 
To calculate a country's total green house gas emission from the per person value in the `Emission` column, we will need to obtain each country's population.  The `gapminder.csv` dataset has just that. It is a dataset located in the `/data` folder that has been minorly edited from the [Gapminder website](https://www.gapminder.org/data/) which is a tool and resource that promotes [sustainable global development and achievement of the United Nations Millennium Development Goals](https://www.gapminder.org/about-gapminder/our-mission/). It contains the population of each country from the years 1992 - 2020. Load only the `Country` column and the columns between 2008-2011 (You will have to put the column years in single quotations ex:`'2008'`) and name the dataframe `gapminder`.

In [40]:
gapminder = pd.read_csv('data/gapminder.csv', usecols=['Country','2008', '2009', '2010', '2011'])
gapminder

         Country      2008      2009      2010      2011
0    Afghanistan  27700000  28400000  29200000  30100000
1        Albania   3000000   2970000   2950000   2930000
2        Algeria  34700000  35300000  36000000  36700000
3        Andorra     83900     84500     84500     83700
4         Angola  21700000  22500000  23400000  24200000
..           ...       ...       ...       ...       ...
190    Venezuela  27600000  28000000  28400000  28900000
191      Vietnam  86200000  87100000  88000000  88900000
192        Yemen  21900000  22500000  23200000  23800000
193       Zambia  12800000  13200000  13600000  14000000
194     Zimbabwe  12400000  12500000  12700000  12900000

[195 rows x 5 columns]

In [41]:
t.test_4a(gapminder)

'Success'

 **Question 4(b)** <br> {points: 1} 
 
Use `.melt()` to transform `gapminder` into a long dataframe. Name the new columns `Year` and `Population`.    
Name the new object `gapminder_long`.

In [42]:
gapminder_long = (gapminder.melt(id_vars=['Country'],
                                value_vars=['2008', '2009', '2010', '2011'],
                                var_name='Year',
                                value_name='Population'
                                ))
gapminder_long

         Country  Year  Population
0    Afghanistan  2008    27700000
1        Albania  2008     3000000
2        Algeria  2008    34700000
3        Andorra  2008       83900
4         Angola  2008    21700000
..           ...   ...         ...
775    Venezuela  2011    28900000
776      Vietnam  2011    88900000
777        Yemen  2011    23800000
778       Zambia  2011    14000000
779     Zimbabwe  2011    12900000

[780 rows x 3 columns]

In [43]:
t.test_4b(gapminder_long)

'Success'

**Question 4(c)** <br> {points: 1} 
 
Use `.merge()` to join the dataframes `emissions` and `gapminder_long`. Use identifying columns `Country` and `Year` and use the `outer` join type. Make sure to add the `_merge` column with the `indicator` argument.    
Name the new object `emissions_pop`.

In [44]:
emissions_pop = gapminder_long.merge(emissions, left_on=['Country', 'Year'], right_on=['Country', 'Year'], how='outer', indicator=True)
emissions_pop

,Country,Year,Population,Continent,Emission,_merge
0,Afghanistan,2008,27700000.0,Asia,0.158962,both
1,Albania,2008,3000000.0,Europe,1.580113,both
2,Algeria,2008,34700000.0,Africa,3.205183,both
3,Andorra,2008,83900.0,Europe,6.296125,both
4,Angola,2008,21700000.0,Africa,1.369425,both
...,...,...,...,...,...,...
823,Turks And Caicos Islands,2011,NaN,North America,6.010149,right_only
824,West Bank And Gaza,2008,NaN,Asia,0.570947,right_only
825,West Bank And Gaza,2009,NaN,Asia,0.564578,right_only
826,West Bank And Gaza,2010,NaN,Asia,0.534015,right_only
827,West Bank And Gaza,2011,NaN,Asia,0.572407,right_only

In [45]:
t.test_4c(emissions_pop)

'Success'

**Question 4(d)** <br> {points: 1} 

Let's put our concentration on just the year 2010. Filter so we only have the year 2010 and drop the column named `Year`.     
Name this dataframe `emissions_2010`.

In [46]:
emissions_2010 = emissions_pop[emissions_pop['Year'] == '2010'].drop('Year', axis=1)

In [47]:
t.test_4d(emissions_2010)

'Success'

**Question 4(e)** <br> {points: 3} 

How many countries are missing from the left and right dataframes? Save the filtered shape (and using `[0]` to get the row dimension only) as objects named `missing_left`, `missing_right`. 

Create a new dataframe that only contains the rows that were present in both `emissions` and `gapminder_long` . 
Name this dataframe `emissions_both`. 

* Hint: Looking at the `_merge` column may be helpful.

In [48]:
missing_left = emissions_2010[emissions_2010['_merge'] == 'right_only'].shape[0]
missing_right = emissions_2010[emissions_2010['_merge'] == 'left_only'].shape[0]
emissions_both = emissions_2010[emissions_2010['_merge'] == 'both']

In [49]:
t.test_4e(missing_left, missing_right, emissions_both)

'Success'

**Question 4(f)** <br> {points: 2} 

Make a new column for the total quantity of emissions for each country and name it `Quantity`. Currently we have the column `Emission` which is the greenhouse gas emissions in tonnes **per person** in the year 2010 and the number of people in the column `Population`. Use the `emissions_both` dataframe.

In [50]:
emissions_total = emissions_both.assign(Quantity=emissions_both['Emission'] * emissions_both['Population'])
emissions_total

         Country  Population      Continent  Emission _merge      Quantity
390  Afghanistan  29200000.0           Asia  0.302936   both  8.845743e+06
391      Albania   2950000.0         Europe  1.515632   both  4.471115e+06
392      Algeria  36000000.0         Africa  3.309912   both  1.191568e+08
393      Andorra     84500.0         Europe  6.124770   both  5.175431e+05
394       Angola  23400000.0         Africa  1.401654   both  3.279871e+07
..           ...         ...            ...       ...    ...           ...
580    Venezuela  28400000.0  South America  6.811756   both  1.934539e+08
581      Vietnam  88000000.0           Asia  1.761695   both  1.550292e+08
582        Yemen  23200000.0           Asia  1.090060   both  2.528940e+07
583       Zambia  13600000.0         Africa  0.192079   both  2.612270e+06
584     Zimbabwe  12700000.0         Africa  0.646073   both  8.205124e+06

[185 rows x 6 columns]

In [51]:
assert 'emissions_total' in locals(), "Your answer should be named 'emissions_total'"

# Note that this test has been hidden intentionally.
# It will provide no feedback as to the correctness of your answers.
# Thus, it is up to you to decide if your answer is sufficiently correct.

**Question 4(g)** <br> {points: 1} 

Group the `emissions_total` dataframe by continent and use `.agg()` to obtain the total sum of the `Population` and `Quantity` for each continent. Save this as `continent_emissions`.

In [52]:
continent_emissions = emissions_total.groupby('Continent').agg('sum').loc[:,['Population', 'Quantity']]
continent_emissions

                 Population      Quantity
Continent
Africa         1.028338e+09  1.190918e+09
Asia           4.292061e+09  1.800648e+10
Europe         6.096065e+08  4.303124e+09
North America  5.367359e+08  6.501571e+09
Oceania        3.607440e+07  4.102680e+08
South America  3.924880e+08  1.057943e+09

In [53]:
t.test_4g(continent_emissions)

'Success'

**Question 4(h)** <br> {points: 1} 

Create a new column named `Emission_pp` from the `continent_emissions` dataframe which is the amount of emission **per person in each continent**. This can be made by dividing the `Quantity` column by the `Population` column.        
Save the dataframe as object `continent_emissions_pp`.

In [54]:
continent_emissions_pp = (continent_emissions
                          .assign(
                            Emission_pp=continent_emissions['Quantity'] / continent_emissions['Population']))
continent_emissions_pp

                 Population      Quantity  Emission_pp
Continent
Africa         1.028338e+09  1.190918e+09     1.158099
Asia           4.292061e+09  1.800648e+10     4.195300
Europe         6.096065e+08  4.303124e+09     7.058854
North America  5.367359e+08  6.501571e+09    12.113166
Oceania        3.607440e+07  4.102680e+08    11.372828
South America  3.924880e+08  1.057943e+09     2.695478

In [55]:
t.test_4h(continent_emissions_pp)

'Success'

**Question 4(i)** <br> {points: 1} 

Plot in a bar graph, the `Emission_pp` for each continent from highest to lowest and name the plot `continent_emissions_pp_plot`. Give it a title as well.

Note that you will need to use the `reset_index` function.

In [56]:
continent_emissions_pp = continent_emissions_pp.reset_index()
continent_emissions_pp_plot = (alt.Chart(continent_emissions_pp)
                               .mark_bar()
                               .encode(x='Continent:N', y='Emission_pp:Q')
                               .properties(title='Emissions per person in each Continent')
                              )
continent_emissions_pp_plot

alt.Chart(...)

In [57]:
t.test_4i(continent_emissions_pp_plot)

'Success'

Before submitting your assignment please do the following:

- Read through your solutions
- **Restart your kernel and clear output and rerun your cells from top to bottom** 
- Makes sure that none of your code is broken 
- Verify that the tests from the questions you answered have obtained the output "Success"

This is a simple way to make sure that you are submitting all the variables needed to mark the assignment. This method should help avoid losing marks due to changes in your environment.

## Attributions
- Gapminder Dataset - [Gapminder](https://www.gapminder.org/data/)
- Astronaut Dataset - [Kaggle](https://www.kaggle.com/nasa/astronaut-yearbook?select=astronauts.csv)
- Netflix Dataset - [Kaggle](https://www.kaggle.com/shivamb/netflix-shows?select=netflix_titles.csv)
- MDS DSCI 523 - Data Wrangling course - [MDS's GitHub website](hhttps://ubc-mds.github.io/)

## Module Debriefing

If this video is not showing up below, click on the cell and click the ▶ button in the toolbar above.

In [58]:
from IPython.display import YouTubeVideo
YouTubeVideo('/X0eqYP2t3kA', width=854, height=480)